Tekla Open API Reference for Tekla Structures 2025
Seam.Code Property
 The code of the seam. The code can be used to classify the seam. The code can be reported and shown in drawings. The maximum length of the string is 20 characters.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Code { get; set; }
Public Property Code As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Seam Class
Tekla.Structures.Model Namespace